tap "homebrew/bundle"
tap "homebrew/services"

# brew info --json=v2 --installed | jq -r '.formulae[]|select(any(.installed[]; .installed_on_request)) | [.full_name, .desc] | @tsv' | column -ts $'\t'

brew "age"
brew "aria2"
brew "atuin"
brew "automake"
brew "awscli"
brew "bat"
brew "bazelisk"
brew "bison"
brew "buildifier"
brew "ca-certificates"
brew "chezmoi"
brew "chruby"
brew "cloc"
brew "cmake"
brew "cosign"
brew "curl"
brew "der-ascii"
brew "diffoscope"
brew "docker-credential-helper"
brew "duckdb"
brew "dust"
brew "eksctl"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "freetype"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git"
brew "gitleaks"
brew "go"
brew "goreleaser"
brew "grep"
brew "hdf5"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jenv"
brew "jj"
brew "jq"
brew "libffi"
brew "libpng"
brew "libxml2"
brew "libxmlsec1"
brew "libyaml"
brew "memcached"
brew "mysql-client"
brew "mysql"
brew "openapi-generator"
brew "openssl@1.1"
brew "openssl@3"
brew "overmind"
brew "pam-reattach"
brew "pigz"
brew "pkgconf"
brew "postgresql@15", restart_service: true
brew "powerlevel10k"
brew "pre-commit"
brew "prettier"
brew "pstree"
brew "qrencode"
brew "readline"
brew "redis"
brew "rip2"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "source-highlight"
brew "ssh-copy-id"
brew "tailscale"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags"
brew "uv"
brew "wget"
brew "xcodes"
brew "yamllint"
brew "yq"
brew "yt-dlp"
brew "zizmor"
brew "zoxide"
brew "zsh"
brew "zstd"


cask "1password-cli"
cask "aws-vault"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "ghostty"
cask "launchcontrol"
cask "macvim"
cask "mimestream"
cask "ngrok"
cask "orbstack"
cask "postman"
cask "visual-studio-code"
cask "vlc"


tap "eth-p/software"
brew "eth-p/software/bat-extras"

tap "nerdsniped/microplane"
brew "nerdsniped/microplane/microplane"

tap "keith/formulae"
brew "keith/formulae/git-pile"

tap "shopify/shopify"
brew "shopify/shopify/ejson"
